AeRgIo74/tiva_prueb2_2/examples/boards/ek-tm4c1294xl/mini_project/mini_project.c
#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h" 
#include "driverlib/uart.h"
#include "utils/uartstdio.h"
#include <string.h>
#include <stdio.h>
#include <ctype.h>
#include <stdlib.h>

// System clock rate in Hz.
//
//****************************************************************************
uint32_t g_ui32SysClock;

//*****************************************************************************
//
// Flags that contain the current value of the interrupt indicator as displayed
// on the UART.
//
//*****************************************************************************

uint32_t tiempo = 1;
uint32_t contador2[100];
uint32_t contador;
uint32_t g_ui32Flags;
char receivedData[7] = {0};  // Para almacenar la palabra "buzzer"
static uint8_t index = 0;  // Índice para almacenar los caracteres recibidos

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

//*****************************************************************************
//
// The interrupt handler for the first timer interrupt.
//
//*****************************************************************************
void UARTSend(const uint8_t *pui8Buffer, uint32_t ui32Count)
{
    while (ui32Count--)
    {
        UARTCharPutNonBlocking(UART0_BASE, *pui8Buffer++);
    }
}
void Timer0IntHandler(void)
{
    char cOne, cTwo;

    // Clear the timer interrupt.
    //
    TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
    HWREGBITW(&g_ui32Flags, 0) ^= 1;
    // Encender o apagar los LEDs según el valor del contador usando desplazamiento de bits
    if(contador2 > 20) {
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, GPIO_PIN_4 ); // Bit 2
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_0, GPIO_PIN_0 ); // Bit 2
    }
    //
    // Update the interrupt status.
    //
    IntMasterDisable();
    cOne = HWREGBITW(&g_ui32Flags, 0) ? '1' : '0';
    cTwo = HWREGBITW(&g_ui32Flags, 1) ? '1' : '0';
    // Agrega un debug para ver el estado de las variables
    UARTprintf("cOne: %d, cTwo: %d, time: %d, contador: %d\n", cOne, cTwo, tiempo, contador2);


    TimerLoadSet(TIMER0_BASE, TIMER_A, (uint32_t)(g_ui32SysClock * tiempo));
    IntMasterEnable();
}

//*****************************************************************************
//
// The interrupt handler for the second timer interrupt.
//
//*****************************************************************************
void Timer1IntHandler(void)
{
    char cOne, cTwo;
    //
    // Clear the timer interrupt.
    //
    TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
    HWREGBITW(&g_ui32Flags, 1) ^= 1;
    //
    // Toggle the flag for the second timer.
    //

    if (GPIOPinRead(GPIO_PORTJ_BASE, GPIO_PIN_0) == 0)
         {
             tiempo++;
         }
    //
    if (GPIOPinRead(GPIO_PORTJ_BASE, GPIO_PIN_1) == 0)
         {
             tiempo--;
             if (tiempo<=0){tiempo=1;}
         }
    // Update the interrupt status.
    // 
    IntMasterDisable();
    cOne = HWREGBITW(&g_ui32Flags, 0) ? '1' : '0';
    cTwo = HWREGBITW(&g_ui32Flags, 1) ? '1' : '0';
    // Agrega un debug para ver el estado de las variables
    UARTprintf("cOne: %d, cTwo: %d\n", cOne, cTwo);
    IntMasterEnable();
}
#define MAX_BUFFER_SIZE 10

// Variables globales
char uartBuffer[MAX_BUFFER_SIZE];  // Buffer para almacenar la cadena recibida
uint8_t bufferIndex = 0;           // Índice para controlar el buffer


void UARTIntHandler(void)
{
    uint32_t ui32Status;

    // Obtener el estado de la interrupción de UART
    ui32Status = UARTIntStatus(UART0_BASE, true);
    // Limpiar la interrupción
    UARTIntClear(UART0_BASE, ui32Status);

    // Mientras haya datos disponibles en UART
    while (UARTCharsAvail(UART0_BASE))
    {
        char receivedChar = UARTCharGetNonBlocking(UART0_BASE);  // Leer carácter recibido

        // Ignorar caracteres de nueva línea y retorno de carro
        if (receivedChar == '\n' || receivedChar == '\r')
        {
            continue;
        }

        UARTCharPutNonBlocking(UART0_BASE, receivedChar);  // Eco del carácter recibido

        // Guardar el carácter recibido en el buffer
        if (index < 6)  // Asegurarse de no superar el tamaño del buffer
        {
            receivedData[index] = receivedChar;
            index++;
        }

        // Si se ha recibido la palabra "buzzer"
        if (index == 6 && strncmp(receivedData, "buzzer", 6) == 0)
        {
            contador = 1;
            index = 0;  // Reiniciar el índice para recibir la siguiente palabra
            memset(receivedData, 0, sizeof(receivedData));  // Limpiar el buffer
        }

        // Reiniciar el índice si se sobrepasa el tamaño del buffer
        if (index >= 6)
        {
            index = 0;
            memset(receivedData, 0, sizeof(receivedData));  // Limpiar el buffer
        }
    }
}



//////////////////////////////////////
//*****************************************************************************
//
// Configure the UART and its pins.  This must be called before UARTprintf().
//
//*****************************************************************************
void ConfigureUART(void)
{
    //
    // Enable the GPIO Peripheral used by the UART.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

    //
    // Enable UART0.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

    //
    // Configure GPIO Pins for UART mode.
    //
    GPIOPinConfigure(GPIO_PA0_U0RX);
    GPIOPinConfigure(GPIO_PA1_U0TX);
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    //
    // Initialize the UART for console I/O.
    //
    UARTStdioConfig(0, 115200, g_ui32SysClock);
}
void interrupcio_UART(void){
    // Habilitar interrupciones UART
    IntEnable(INT_UART0);
    UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
}
void boton(void){
    // Habilitar el periférico GPIOJ
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
    // Configurar PJ0 y PJ1 como entradas con resistencias pull-up
    GPIOPinTypeGPIOInput(GPIO_PORTJ_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    GPIOPadConfigSet(GPIO_PORTJ_BASE, GPIO_PIN_0 | GPIO_PIN_1, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);
}
void user_led_N(void){
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_1|GPIO_PIN_0);
}
void user_led_F(void){
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_4|GPIO_PIN_0);
}
//*****************************************************************************
//
// This example application demonstrates the use of the timers to generate
// periodic interrupts.
//
//*****************************************************************************
int main(void)
{
    //
    // Run from the PLL at 120 MHz.
    // Note: SYSCTL_CFG_VCO_240 is a new setting provided in TivaWare 2.2.x and
    // later to better reflect the actual VCO speed due to SYSCTL#22.
    //
    g_ui32SysClock = SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                             SYSCTL_OSC_MAIN |
                                             SYSCTL_USE_PLL |
                                             SYSCTL_CFG_VCO_240), 120000000);

    //
    // Initialize the UART and write status.
    //
    ConfigureUART();
    interrupcio_UART();
    boton();
    user_led_F();
    user_led_N();
    
    //
    // Enable the peripherals used by this example.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER1);

    //
    // Enable processor interrupts.
    //
    IntMasterEnable();

    //
    // Configure the two 32-bit periodic timers.
    //
    TimerConfigure(TIMER0_BASE, TIMER_CFG_PERIODIC);
    TimerConfigure(TIMER1_BASE, TIMER_CFG_PERIODIC);
    TimerLoadSet(TIMER0_BASE, TIMER_A, g_ui32SysClock);
    TimerLoadSet(TIMER1_BASE, TIMER_A, g_ui32SysClock *0.2);

    //
    // Setup the interrupts for the timer timeouts.
    //
    IntEnable(INT_TIMER0A);
    IntEnable(INT_TIMER1A);
    TimerIntEnable(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
    TimerIntEnable(TIMER1_BASE, TIMER_TIMA_TIMEOUT);

    //
    // Enable the timers.
    //
    TimerEnable(TIMER0_BASE, TIMER_A);
    TimerEnable(TIMER1_BASE, TIMER_A);

    //
    // Loop forever while the timers run.
    //
    while(1)
    {
    }
}
